tsung/templates/template-http-get-ssl.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/tsung/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

	<!-- Client side setup -->
	<clients>
		<client host="localhost" maxusers="10000" use_controller_vm="true">
			<ip scan="true" value="eth0"/>
		</client>
	</clients>

	<!-- Server side setup -->
	<servers>
		<server host="dhcp-flab2-43.cesnet.cz" port="443" type="ssl"></server> 
	</servers>

	<load>
		<arrivalphase phase="1" duration="10" unit="minute">
			<users maxnumber="1000" arrivalrate="1000" unit="second"/>
		</arrivalphase>
	</load>

	<options>
		<option type="ts_http" name="user_agent">
			<user_agent probability="100">Tsung - Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
		</option>
		<option name="ssl_versions" value="'tlsv1.2'"/>
		<option name="ports_range" min="1025" max="65535"/>
	</options>

	<sessions>
		<session name="http-example" probability="100" type="ts_http">
			<for from="1" to="1" var="i">
				<request subst="true">
					<http url='/test.php' version='1.1' method='GET'></http>
				</request>
			</for>
		</session>
	</sessions>
</tsung>
