tsung/templates/template.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/tsung/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
   __TSUNG_clients
  </clients>

  <!-- Server side setup -->
  <servers>
	  <server host="__TSUNG_host" port="__TSUNG_port" type="__TSUNG_secure"></server>
  </servers>

  <load>
        <arrivalphase phase="1" duration="100" unit="minute">
                <users maxnumber="__TSUNG_users" arrivalrate="__TSUNG_usersarrival" unit="second"/>
        </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="20">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    <user_agent probability="20">Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; WOW64; Trident/5.0)</user_agent>
    <user_agent probability="20">Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.0)</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36</user_agent>
   </option>
   <option name="ssl_versions" value="'tlsv1.2'"/>
   <!--<option name="ports_range" min="1024" max="65535" />-->
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-example" probability="100" type="ts_http">
    <!-- full url with server name, this overrides the "server" config value -->
        <for from="1" to="__TSUNG_requests" var="i">
                <request subst="true">
                        <http url='__TSUNG_uri' version='1.1' content_type='application/x-www-form-urlencoded' method='__TSUNG_method' contents='__TSUNG_content'></http>
                </request>
        </for>
  </session>
 </sessions>
</tsung>

